In [4]:
%reload_ext sql

In [6]:
%sql sqlite:///sample1.db

'Connected: None@sample1.db'

In [8]:
%sql select * from dept;

Done.

[(1, '영업', 8), (2, '기획', 10), (3, '개발', 9), (4, '총부', 7)]

In [10]:
%sql select * from dept, emp where dept.deptno = emp.dno;

Done.

[(2, '기획', 10, 4377, '이성래', '사장', None, 5000000, 2),
 (1, '영업', 8, 3426, '박영권', '과장', 4377, 3000000, 1),
 (3, '개발', 9, 3011, '이수민', '부장', 4377, 4000000, 3),
 (3, '개발', 9, 3427, '최종철', '사원', 3011, 1500000, 3),
 (2, '기획', 10, 1003, '조민희', '과장', 4377, 3000000, 2),
 (2, '기획', 10, 2106, '김창섭', '대리', 1003, 2500000, 2),
 (1, '영업', 8, 1365, '김상원', '사원', 3426, 1500000, 1)]

In [12]:
%sql select * from emp;

Done.

[(4377, '이성래', '사장', None, 5000000, 2),
 (3426, '박영권', '과장', 4377, 3000000, 1),
 (3011, '이수민', '부장', 4377, 4000000, 3),
 (3427, '최종철', '사원', 3011, 1500000, 3),
 (1003, '조민희', '과장', 4377, 3000000, 2),
 (2106, '김창섭', '대리', 1003, 2500000, 2),
 (1365, '김상원', '사원', 3426, 1500000, 1)]

In [14]:
%%sql
select * from dept, emp
where dept.deptno = emp.dno;

Done.

[(2, '기획', 10, 4377, '이성래', '사장', None, 5000000, 2),
 (1, '영업', 8, 3426, '박영권', '과장', 4377, 3000000, 1),
 (3, '개발', 9, 3011, '이수민', '부장', 4377, 4000000, 3),
 (3, '개발', 9, 3427, '최종철', '사원', 3011, 1500000, 3),
 (2, '기획', 10, 1003, '조민희', '과장', 4377, 3000000, 2),
 (2, '기획', 10, 2106, '김창섭', '대리', 1003, 2500000, 2),
 (1, '영업', 8, 1365, '김상원', '사원', 3426, 1500000, 1)]